{
  "name": "Mnemonic Realms v2.0 — Game Bible",
  "description": "Author the complete game bible as markdown documentation. Every location, character, quest, item, enemy, and system fully specified. No code — pure content.",
  "branchName": "ralph/v2-bible",
  "userStories": [
    {
      "id": "US-001",
      "title": "Author detailed geography document with zone specs",
      "description": "As a game designer, I need a complete geography document specifying every zone in the game world with tile-level detail, so map designers know exactly what to build.",
      "acceptanceCriteria": [
        "docs/world/geography.md created",
        "Defines 5+ distinct zones: Village Hub, Settled Lands, Frontier, The Sketch, The Depths",
        "Each zone has: size (tile dimensions), biome type, dominant tileset, key landmarks, connections to other zones",
        "Village Hub specifies building positions: shop, elder's house, quest board, inn, training ground",
        "Frontier specifies vibrancy transition gradients",
        "The Sketch specifies abstract/unfinished tile aesthetics",
        "Cross-references docs/world/setting.md for consistency",
        "No TBD markers remain"
      ],
      "priority": 1,
      "passes": false,
      "notes": "SEQUENTIAL — must complete before map docs (US-015+). Read docs/world/setting.md for context. The world is young and unfinished, not dying."
    },
    {
      "id": "US-002",
      "title": "Author per-zone vibrancy system specification",
      "description": "As a game designer, I need the vibrancy mechanic fully specified so implementers know exactly how broadcasting memories changes zone visuals and gameplay.",
      "acceptanceCriteria": [
        "docs/world/vibrancy-system.md created",
        "Defines vibrancy scale: 0-100 per zone",
        "Three visual tiers: Muted (0-33), Normal (34-66), Vivid (67-100)",
        "Specifies exactly which tiles swap at each threshold for each biome type",
        "Defines how broadcasting a memory fragment changes vibrancy (formula or table)",
        "Defines vibrancy decay (if any) and Preserver reinforcement mechanics",
        "Specifies global ambient effects (sky color, particle density) as average of visited zones",
        "Audio layer changes per vibrancy tier documented",
        "Cross-references docs/design/memory-system.md",
        "No TBD markers remain"
      ],
      "priority": 1,
      "passes": false,
      "notes": "PARALLEL with US-001. Read docs/design/memory-system.md and docs/design/visual-direction.md for context."
    },
    {
      "id": "US-003",
      "title": "Author dormant gods document with all recall options",
      "description": "As a game designer, I need all four dormant gods fully specified with their recall options and world-state effects.",
      "acceptanceCriteria": [
        "docs/world/dormant-gods.md created",
        "Four gods defined: Resonance (sound), Verdance (growth), Luminos (light), Kinesis (motion)",
        "Each god has: origin story (which dissolved civilization created them), dormant location, discovery quest trigger",
        "Each god has 4 recall options based on emotion type (joy/fury/sorrow/awe)",
        "Each recall option specifies: god's new name, new domain, passive world effect, player buff, NPC behavior change, new side quests unlocked",
        "Total: 16 distinct recall outcomes documented",
        "Recall is permanent — document why and how this creates replay value",
        "Cross-references docs/world/factions.md (Dormant Pantheon section)",
        "No TBD markers remain"
      ],
      "priority": 1,
      "passes": false,
      "notes": "PARALLEL with US-001, US-002. Read docs/world/factions.md for the Dormant Pantheon concept. Each god = one Act II set piece."
    },
    {
      "id": "US-004",
      "title": "Author Act I scene-by-scene script",
      "description": "As a game designer, I need a complete scene-by-scene script for Act I so dialogue writers and event programmers know exactly what happens.",
      "acceptanceCriteria": [
        "docs/story/act1-script.md created",
        "10-15 scenes covering: player arrival, meeting Lira, learning memory operations, first combat, village exploration, NPC relationships, first Stagnation Zone discovery, Lira getting frozen",
        "Each scene has: location, involved characters, trigger condition, dialogue (full text), player actions, rewards/consequences",
        "Tutorial integration: which scenes teach which mechanics (collect, remix, broadcast, combat)",
        "Emotional arc clear: wonder → learning → growing confidence → shock (Lira frozen)",
        "Cross-references docs/story/structure.md Act I section",
        "Cross-references docs/story/characters.md for character voice consistency",
        "No TBD markers remain"
      ],
      "priority": 2,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-001 (geography for locations). Read docs/story/structure.md and docs/story/characters.md first."
    },
    {
      "id": "US-005",
      "title": "Author Act II scene-by-scene script",
      "description": "As a game designer, I need a complete Act II script covering the Frontier expansion, god recalls, and moral complexity.",
      "acceptanceCriteria": [
        "docs/story/act2-script.md created",
        "15-20 scenes covering: Frontier exploration, 4 dormant god recall sequences, Preserver confrontations, moral dilemma scenes, Curator's endgame reveal",
        "Each god recall is a major set piece with: location, puzzle/challenge, emotion choice moment, immediate world-state change",
        "At least 2 scenes where preservation is the right call (moral complexity)",
        "Frontier settlements with unique NPCs and memory-sharing quests",
        "Emotional arc: confidence → moral questioning → determination",
        "Cross-references docs/world/dormant-gods.md (US-003) for recall options",
        "Cross-references docs/story/structure.md Act II section",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-003 (dormant gods) and US-004 (Act I establishes characters). This is the longest section."
    },
    {
      "id": "US-006",
      "title": "Author Act III scene-by-scene script",
      "description": "As a game designer, I need a complete Act III script covering the climax, final dungeon, and ending.",
      "acceptanceCriteria": [
        "docs/story/act3-script.md created",
        "10-15 scenes covering: The Sketch traversal, The Depths exploration, Preserver fortress, First Memory confrontation, ending sequence",
        "The Sketch scenes specify abstract/unfinished landscape challenges the player must 'remember into solidity'",
        "Final dungeon (Preserver fortress) is a crystalline museum with specific rooms and puzzles",
        "First Memory scene: player remixes it (not destroy vs preserve), world leaps forward",
        "Ending: world blooms, NPCs evolve, gods fully awaken, Preservers become archivists",
        "Emotional arc: awe → challenge → triumph → wonder (ending)",
        "Cross-references docs/story/structure.md Act III section",
        "No TBD markers remain"
      ],
      "priority": 4,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-005. Keep the hopeful tone — this is NOT grimdark."
    },
    {
      "id": "US-007",
      "title": "Author complete NPC dialogue bank",
      "description": "As a game designer, I need every line of NPC dialogue written and organized so implementers can wire it directly into RPG-JS events.",
      "acceptanceCriteria": [
        "docs/story/dialogue-bank.md created",
        "All named NPCs have complete dialogue: Lira (~30 lines), Callum (~20 lines), Curator (~25 lines)",
        "Dialogue organized by: character → trigger condition → lines",
        "Trigger conditions match scene scripts (Act I/II/III)",
        "Procedural NPC dialogue templates: 10+ greeting variants, 10+ personality lines, 10+ quest hooks",
        "Shop NPC dialogue: browse, buy, sell, insufficient gold, farewell",
        "Dormant god dialogue: per recall form (4 gods × 4 forms = 16 sets)",
        "Voice consistency verified: each character sounds distinct",
        "No TBD markers remain"
      ],
      "priority": 4,
      "passes": false,
      "notes": "PARALLEL with US-006. Can be written alongside Act III since it pulls from all acts. Read docs/story/characters.md for voice."
    },
    {
      "id": "US-008",
      "title": "Author complete quest chains document",
      "description": "As a game designer, I need every quest fully specified with triggers, objectives, rewards, and branching dialogue.",
      "acceptanceCriteria": [
        "docs/story/quest-chains.md created",
        "Main quest chain: 8-12 quests spanning Acts I-III with explicit triggers and completion conditions",
        "Side quests: 10+ optional quests tied to memory broadcasting, NPC relationships, and exploration",
        "God recall quests: 4 quest chains (one per dormant god) with emotion-based branching",
        "Each quest has: ID, title, giver NPC, trigger condition, objectives (numbered), rewards (XP/gold/items/memory fragments), completion dialogue, failure conditions (if any)",
        "Quest dependencies documented (which quests unlock which)",
        "Rewards reference items from docs/design/items-catalog.md (US-010)",
        "No TBD markers remain"
      ],
      "priority": 5,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-004, US-005, US-006 (act scripts define quest moments). This is the bridge between story and implementation."
    },
    {
      "id": "US-009",
      "title": "Author class progression document with stat tables",
      "description": "As a game designer, I need exact XP curves, stat growth tables, and skill unlock schedules for all four classes.",
      "acceptanceCriteria": [
        "docs/design/progression.md created",
        "XP curve: table of XP required per level (1-30), formula documented",
        "Stat growth per level per class: HP, SP, STR, INT, DEF, AGI as exact numbers (not ranges)",
        "Skill unlock schedule: which skills unlock at which levels for each class (4 classes × 6-8 skills each)",
        "Memory-based progression: how memory broadcasting affects class power (per docs/design/classes.md)",
        "Subclass unlock conditions (Act II, tied to god recall)",
        "Level cap and endgame stat targets documented",
        "Balanced: no class is obviously dominant in all situations",
        "No TBD markers remain"
      ],
      "priority": 2,
      "passes": false,
      "notes": "PARALLEL with US-001-003. Read docs/design/classes.md and docs/design/combat.md for context. Systems section — independent of story."
    },
    {
      "id": "US-010",
      "title": "Author complete items catalog",
      "description": "As a game designer, I need every item in the game specified with stats, prices, and acquisition methods.",
      "acceptanceCriteria": [
        "docs/design/items-catalog.md created",
        "Weapons: 12+ weapons across 4 types (sword, bow, staff, dagger) with name, ATK, price, special effect, acquisition",
        "Armor: 8+ pieces across types (shield, helmet, robe, leather) with name, DEF, price, special, acquisition",
        "Consumables: 8+ items (potions, antidotes, elixirs, scrolls) with name, effect, price, stack limit",
        "Key Items: 5+ quest-related items (non-consumable) with name, description, quest link",
        "Memory Fragments: catalog of named fragments with source, emotion, element, potency",
        "Items organized by acquisition method: shop, drop, quest reward, exploration",
        "Prices balanced relative to gold income from combat",
        "No TBD markers remain"
      ],
      "priority": 2,
      "passes": false,
      "notes": "PARALLEL with US-009. Systems section. These items will be referenced by quest rewards (US-008) and enemy drops (US-011)."
    },
    {
      "id": "US-011",
      "title": "Author complete enemies catalog",
      "description": "As a game designer, I need every enemy in the game specified with stats, abilities, drops, and spawn locations.",
      "acceptanceCriteria": [
        "docs/design/enemies-catalog.md created",
        "Overworld enemies: 6+ types with name, stats (HP/ATK/DEF/AGI), abilities, XP, gold, drop table, spawn zone",
        "Dungeon enemies: 6+ types, scaled 1.3-1.9x from overworld equivalents",
        "Preserver agents: 3+ types with unique stasis-themed abilities",
        "Bosses: 4+ major bosses (one per dormant god area + final boss) with multi-phase mechanics",
        "Final boss: The Curator's crystalline guardian, 3-phase fight, unique mechanics per phase",
        "Each enemy has: flavor text tying it to the memory/vibrancy theme",
        "Drop tables reference docs/design/items-catalog.md (US-010)",
        "Spawn locations reference docs/world/geography.md (US-001)",
        "Difficulty curve: enemies get harder as player progresses through zones",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-009 (to balance against player stats) and US-010 (for drop items). Also needs US-001 (zones for spawn locations)."
    },
    {
      "id": "US-012",
      "title": "Author complete skills catalog",
      "description": "As a game designer, I need every skill per class fully specified with formulas, costs, and animations.",
      "acceptanceCriteria": [
        "docs/design/skills-catalog.md created",
        "Knight skills: 6-8 skills with name, level learned, SP cost, damage formula, target type, animation description",
        "Cleric skills: 6-8 skills focusing on healing and support",
        "Mage skills: 6-8 skills with element system and inspired casting mechanics",
        "Rogue skills: 6-8 skills with foreshadow and evasion mechanics",
        "Each skill references the class memory twist from docs/design/classes.md",
        "Damage formulas use variables from docs/design/combat.md",
        "Skills balanced: no single skill dominates all encounters",
        "Status effect skills reference status table from docs/design/combat.md",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "PARALLEL with US-011. Depends on US-009 (progression determines when skills unlock)."
    },
    {
      "id": "US-013",
      "title": "Author tileset specification for all biomes and vibrancy levels",
      "description": "As an artist/implementer, I need a tile-by-tile spec for every biome at every vibrancy level.",
      "acceptanceCriteria": [
        "docs/design/tileset-spec.md created",
        "Biomes covered: grassland, forest, mountain, water, village, dungeon, stagnation, sketch",
        "Each biome has tiles for 3 vibrancy levels (muted, normal, vivid)",
        "Tile list per biome: ground, path, decoration, obstacle, transition (edge tiles between biomes)",
        "Stagnation biome: crystalline overlay variants for each base biome",
        "Sketch biome: abstract/unfinished tile descriptions (shimmering, half-drawn, luminous)",
        "Tile dimensions: 32x32 confirmed",
        "Tileset sheet layout described (how tiles are organized in the PNG)",
        "Color keys per vibrancy level reference docs/design/visual-direction.md palette",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "PARALLEL with US-011, US-012. Depends on US-002 (vibrancy system defines the tier thresholds). Art spec for GenAI pipeline (Phase 3)."
    },
    {
      "id": "US-014",
      "title": "Author spritesheet and audio specifications",
      "description": "As an artist/implementer, I need sprite specs for all characters/enemies and audio specs for all zones.",
      "acceptanceCriteria": [
        "docs/design/spritesheet-spec.md created with: player sprites (4 classes × idle/walk/attack/cast/hit), NPC sprites (6+ types), enemy sprites (12+ types), boss sprites (4+), Preserver agent sprites",
        "Each sprite: dimensions, animation frames, direction count, color key per class",
        "docs/design/audio-direction.md created with: BGM per zone/act (8+ tracks), SFX catalog (20+ effects), vibrancy audio layers (how music adds instruments per tier)",
        "Audio describes mood/style per track, not specific files",
        "Stagnation zones: muffled/stripped audio effect described",
        "Combat music: normal battle theme, boss battle theme, Preserver battle theme",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "PARALLEL with US-013. Art/audio specs for GenAI pipeline. Read docs/design/visual-direction.md for style guidelines."
    },
    {
      "id": "US-015",
      "title": "Author UI wireframes specification for all GUI screens",
      "description": "As a frontend implementer, I need wireframe specs for every in-game GUI screen.",
      "acceptanceCriteria": [
        "docs/design/ui-spec.md created",
        "Screens specified: title screen (class selection, no seed input), HUD overlay, combat GUI, inventory/equipment, memory collection grid, memory remix interface, dialogue panel, shop, quest log, game over, victory/ending",
        "Each screen has: layout description, element list with positions, responsive behavior (mobile vs desktop), color scheme reference, font specs, interaction model (tap targets, swipe areas)",
        "Title screen: class carousel (no seed input — seed is buried internally)",
        "Memory collection grid: how fragments are displayed, sorted, filtered",
        "Memory remix interface: how player combines fragments (drag? select? menu?)",
        "Mobile-first: all screens must work at 375px width",
        "No TBD markers remain"
      ],
      "priority": 3,
      "passes": false,
      "notes": "PARALLEL with US-013, US-014. Depends on US-002 (vibrancy affects HUD) and US-009 (progression affects what's shown)."
    },
    {
      "id": "US-016",
      "title": "Author overworld map layout document",
      "description": "As a map designer, I need the complete overworld map specified zone-by-zone with NPC placements, enemy spawns, and event triggers.",
      "acceptanceCriteria": [
        "docs/maps/overworld-layout.md created",
        "Overall map dimensions specified (e.g., 60x60 or 80x80 tiles)",
        "Zone boundaries drawn: Village Hub center, Settled Lands ring, Frontier ring, Sketch edges",
        "Village Hub: building positions, NPC spawn points (Lira, Callum, shop, quest givers), paths",
        "Settled Lands: farm areas, neighboring settlement locations, road connections",
        "Frontier: dungeon entrances, dormant god shrine locations, Preserver stagnation zones",
        "Enemy spawn zones with enemy type assignments from docs/design/enemies-catalog.md",
        "Dungeon entrance positions (one per dormant god area + main dungeon)",
        "Resonance Stone positions for memory fragment collection",
        "Map event list: every trigger with position, type, and linked quest/dialogue",
        "No TBD markers remain"
      ],
      "priority": 5,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-001 (geography), US-008 (quests for trigger placement), US-011 (enemies for spawn zones). This is the map implementation blueprint."
    },
    {
      "id": "US-017",
      "title": "Author dungeon layouts document",
      "description": "As a map designer, I need every dungeon floor fully specified with rooms, corridors, encounters, and puzzles.",
      "acceptanceCriteria": [
        "docs/maps/dungeon-depths.md created",
        "Main dungeon: 3+ floors with room layouts, corridor connections, chest positions, enemy spawns",
        "God shrine dungeons: 4 unique dungeons (one per dormant god) with themed rooms and recall challenge",
        "Preserver fortress (final dungeon): crystalline museum layout with stasis puzzles, frozen NPC positions, boss arena",
        "Each room has: dimensions, tile types, event triggers, enemy spawns, loot",
        "Boss arenas: large rooms (minimum 10x10) with pre-fight dialogue triggers",
        "Dungeon progression: later floors are harder, better loot, denser enemies",
        "No TBD markers remain"
      ],
      "priority": 5,
      "passes": false,
      "notes": "PARALLEL with US-016. Same dependencies. Can be written alongside overworld layout."
    },
    {
      "id": "US-018",
      "title": "Author stagnation zones and frontier zones documents",
      "description": "As a map designer, I need the Preserver zones and unfinished frontier areas fully specified.",
      "acceptanceCriteria": [
        "docs/maps/stagnation-zones.md created with: 3+ stagnation zone layouts, crystalline tile specs, frozen NPC positions, memory broadcasting puzzle requirements (which emotion/element combos break the stasis)",
        "docs/maps/frontier-zones.md created with: transition tile gradients between settled and sketch, unfinished aesthetic descriptions, how player 'remembers' areas into solidity (gameplay mechanic)",
        "Stagnation zones increase in difficulty: first is tutorial (Act I), later ones require specific high-potency fragments",
        "Frontier zones tied to Act II expansion",
        "No TBD markers remain"
      ],
      "priority": 5,
      "passes": false,
      "notes": "PARALLEL with US-016, US-017. Depends on US-002 (vibrancy) and US-003 (dormant gods for frontier shrines)."
    },
    {
      "id": "US-019",
      "title": "Author master event placement document",
      "description": "As an implementer, I need every map event cataloged with exact positions, trigger types, and linked quest/dialogue IDs.",
      "acceptanceCriteria": [
        "docs/maps/event-placement.md created",
        "Every event across all maps listed in a table: event ID, map, position (x,y), trigger type (touch/action/auto), linked quest ID, linked dialogue ID, one-time vs repeatable",
        "Events organized by map, then by type",
        "NPC events: spawn position, movement pattern, graphic ID",
        "Chest events: position, contents (item ID + quantity)",
        "Transition events: source map, destination map, destination position",
        "Cutscene triggers: position, linked act script scene ID",
        "Cross-references: quest-chains.md, dialogue-bank.md, enemies-catalog.md",
        "No TBD markers remain"
      ],
      "priority": 6,
      "passes": false,
      "notes": "SEQUENTIAL — depends on US-016, US-017, US-018 (all map layouts must exist). This is the final map spec before code translation."
    },
    {
      "id": "US-020",
      "title": "Author master index and run consistency check",
      "description": "As a game designer, I need a master cross-reference index and verified consistency across all bible documents.",
      "acceptanceCriteria": [
        "docs/bible/master-index.md created with alphabetical index of every named entity: NPCs (with doc references), locations (with doc references), items (with doc references), quests (with doc references), enemies (with doc references), skills (with doc references), gods (with doc references)",
        "docs/bible/consistency-check.md created documenting: every cross-reference verified (e.g., quest reward items exist in items catalog), no stat contradictions between combat.md formulas and progression.md tables, no location contradictions between geography and map layouts, no character contradictions between characters.md and dialogue-bank.md",
        "docs/bible/implementation-order.md created: ordered list of what to implement first in Phase 2, with rationale",
        "Zero TBD markers across ALL docs/ files",
        "Zero dangling references (nothing references an entity that doesn't exist)"
      ],
      "priority": 7,
      "passes": false,
      "notes": "SEQUENTIAL — depends on ALL previous stories. This is the final validation pass. Read every doc in docs/ and verify internal consistency."
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-13T03:20:14.457Z"
  }
}